Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.argocd.kubernetes_manifest.argocd_repo_server_role will be created
+ resource "kubernetes_manifest" "argocd_repo_server_role" {
      + manifest = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "Role"
          + metadata   = {
              + name      = "argocd-repo-server-role"
              + namespace = "argocd"
            }
          + rules      = [
              + {
                  + apiGroups     = [
                      + "",
                    ]
                  + resourceNames = [
                      + "argocd-vault-plugin-credentials",
                    ]
                  + resources     = [
                      + "secrets",
                    ]
                  + verbs         = [
                      + "get",
                    ]
                },
            ]
        }
      + object   = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "Role"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-repo-server-role"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + rules      = [
              + {
                  + apiGroups       = [
                      + "",
                    ]
                  + nonResourceURLs = (known after apply)
                  + resourceNames   = [
                      + "argocd-vault-plugin-credentials",
                    ]
                  + resources       = [
                      + "secrets",
                    ]
                  + verbs           = [
                      + "get",
                    ]
                },
            ]
        }
    }

  # module.argocd.kubernetes_manifest.argocd_vault_plugin_rolebinding will be created
+ resource "kubernetes_manifest" "argocd_vault_plugin_rolebinding" {
      + manifest = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "RoleBinding"
          + metadata   = {
              + name      = "argocd-repo-server-rolebinding"
              + namespace = "argocd"
            }
          + roleRef    = {
              + apiGroup = "rbac.authorization.k8s.io"
              + kind     = "Role"
              + name     = "argocd-repo-server-role"
            }
          + subjects   = [
              + {
                  + kind      = "ServiceAccount"
                  + name      = "argocd-repo-server"
                  + namespace = "argocd"
                },
            ]
        }
      + object   = {
          + apiVersion = "rbac.authorization.k8s.io/v1"
          + kind       = "RoleBinding"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-repo-server-rolebinding"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + roleRef    = {
              + apiGroup = "rbac.authorization.k8s.io"
              + kind     = "Role"
              + name     = "argocd-repo-server-role"
            }
          + subjects   = [
              + {
                  + apiGroup  = (known after apply)
                  + kind      = "ServiceAccount"
                  + name      = "argocd-repo-server"
                  + namespace = "argocd"
                },
            ]
        }
    }

  # module.argocd.kubernetes_secret.argocd_vault_plugin_credentials will be created
+ resource "kubernetes_secret" "argocd_vault_plugin_credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-vault-plugin-credentials"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.argocd.kustomization_resource.p0["apiextensions.k8s.io/CustomResourceDefinition/_/applications.argoproj.io"] will be created
+ resource "kustomization_resource" "p0" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = false
    }

  # module.argocd.kustomization_resource.p0["apiextensions.k8s.io/CustomResourceDefinition/_/applicationsets.argoproj.io"] will be created
+ resource "kustomization_resource" "p0" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = false
    }

  # module.argocd.kustomization_resource.p0["apiextensions.k8s.io/CustomResourceDefinition/_/appprojects.argoproj.io"] will be created
+ resource "kustomization_resource" "p0" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = false
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-cmd-params-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-gpg-keys-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-notifications-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-rbac-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-ssh-known-hosts-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/argocd-tls-certs-cm"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ConfigMap/argocd/cmp-plugin"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Secret/argocd/argocd-notifications-secret"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Secret/argocd/argocd-secret"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-applicationset-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-dex-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-metrics"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-notifications-controller-metrics"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-redis"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-repo-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/Service/argocd/argocd-server-metrics"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-application-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-applicationset-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-dex-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-notifications-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-redis"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-repo-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["_/ServiceAccount/argocd/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-applicationset-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-dex-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-notifications-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-redis"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-repo-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/Deployment/argocd/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["apps/StatefulSet/argocd/argocd-application-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-application-controller-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-applicationset-controller-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-dex-server-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-notifications-controller-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-redis-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-repo-server-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["networking.k8s.io/NetworkPolicy/argocd/argocd-server-network-policy"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRole/_/argocd-application-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRole/_/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRoleBinding/_/argocd-application-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/ClusterRoleBinding/_/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-application-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-applicationset-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-dex-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-notifications-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/Role/argocd/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-application-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-applicationset-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-dex-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-notifications-controller"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-redis"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

  # module.argocd.kustomization_resource.p1["rbac.authorization.k8s.io/RoleBinding/argocd/argocd-server"] will be created
+ resource "kustomization_resource" "p1" {
      + id       = (known after apply)
      + manifest = (sensitive value)
      + wait     = true

      + timeouts {
          + create = "2m"
          + update = "2m"
        }
    }

Plan: 60 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 60 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
